OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/experimental/piggyOptSimpleFoamPenalty/twoRegionCylinder/fluidMesh/system/decomposeParDict

// * * * * * * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}
method simple;
numberOfSubdomains 2;
scotchCoeffs
{
}

simpleCoeffs 
{ 
    n               (2 1 1); 
    delta           0.001; 
} 
